tutorials/Force_validation(channel)/0.org/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    outlet 
    {
        type            fixedValue;
        value           uniform 0; 
    }

     inlet 
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    stationaryWalls
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

     atmosphere
    {
        type            fixedFluxPressure; // 或者 patch/inletOutlet
        value           uniform 0;
    }
    
   floatingObject
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    frontAndback
    {
        type            empty;
    }
}

// ************************************************************************* //
