tutorials/Force_validation(channel)/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(

    {
        name    c2;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-0.25 -1 -1) (0.25  1  1);
        }
    }
     

    {
        name    porous;
        type    cellZoneSet;
        action  new;  //add,delete,subset,clear,invert,remove
        source  setToCellZone;
        sourceInfo
        {
        set     c2;
        }
    } 
);

// ************************************************************************* //
